-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Feb 28, 2017 at 07:00 PM
-- Server version: 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `humansof_tg_blog`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE IF NOT EXISTS `categories` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=38 ;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'রাজনীতি', '2017-02-20 08:01:38', '2017-02-20 08:01:38'),
(2, 'কবিতা', '2017-02-20 08:01:48', '2017-02-20 08:01:48'),
(3, 'গল্প', '2017-02-20 08:02:16', '2017-02-20 08:02:16'),
(4, 'ছড়া', '2017-02-20 08:02:24', '2017-02-20 08:02:24'),
(5, 'দর্শন', '2017-02-20 08:02:58', '2017-02-20 08:02:58'),
(6, 'প্রবন্ধ', '2017-02-20 08:03:10', '2017-02-20 08:03:10'),
(7, 'বিজ্ঞান ও প্রযুক্তি', '2017-02-20 08:03:21', '2017-02-20 08:03:21'),
(8, 'ভিডিও ব্লগ', '2017-02-20 08:03:26', '2017-02-20 08:03:26'),
(9, 'রান্না-রান্না', '2017-02-20 08:03:42', '2017-02-20 08:03:42'),
(10, 'শিল্প-সাহিত্য', '2017-02-20 08:03:48', '2017-02-20 08:03:48'),
(11, 'সংস্কৃতি', '2017-02-20 08:03:56', '2017-02-20 08:03:56'),
(12, 'মুক্তিযুদ্ধ', '2017-02-20 08:04:55', '2017-02-20 08:04:55'),
(13, 'সমসাময়িক', '2017-02-20 08:05:28', '2017-02-20 08:05:28'),
(14, 'আন্তর্জাতিক', '2017-02-20 08:05:36', '2017-02-20 08:05:36'),
(15, 'দুর্নীতি', '2017-02-20 08:05:43', '2017-02-20 08:05:43'),
(16, 'সাক্ষাৎকার', '2017-02-20 08:05:49', '2017-02-20 08:05:49'),
(17, 'স্যাটায়ার', '2017-02-20 08:07:35', '2017-02-20 08:07:35'),
(18, 'উৎসব', '2017-02-20 08:07:51', '2017-02-20 08:07:51'),
(19, 'দিবস', '2017-02-20 08:07:57', '2017-02-20 08:07:57'),
(20, 'অনুবাদ', '2017-02-20 08:08:04', '2017-02-20 08:08:04'),
(21, 'একুশ', '2017-02-20 08:08:10', '2017-02-20 08:08:10'),
(22, 'খেলাধুলা', '2017-02-20 08:08:17', '2017-02-20 08:08:17'),
(23, 'চলচ্চিত্র', '2017-02-20 08:08:22', '2017-02-20 08:08:22'),
(24, 'ব্যক্তিগত কথাকাব্য', '2017-02-20 08:08:45', '2017-02-20 08:08:45'),
(25, 'ভ্রমণ কাহিনী', '2017-02-20 08:08:52', '2017-02-20 08:08:52'),
(26, 'শোকগাঁথা', '2017-02-20 08:08:59', '2017-02-20 08:08:59'),
(27, 'রিভিউ', '2017-02-26 22:44:40', '2017-02-26 22:44:40'),
(28, 'ফটোব্লগ', '2017-02-26 22:49:58', '2017-02-26 22:49:58'),
(29, 'ঝালমুড়ি', '2017-02-26 22:50:18', '2017-02-26 22:50:18'),
(30, 'খবর', '2017-02-26 22:50:40', '2017-02-26 22:50:40'),
(31, 'কার্টুন', '2017-02-26 22:51:03', '2017-02-26 22:51:03'),
(32, 'উপন্যাস', '2017-02-26 22:51:25', '2017-02-26 22:51:25'),
(33, 'ইতিহাস', '2017-02-26 22:51:41', '2017-02-26 22:51:41'),
(34, 'অনুগল্প', '2017-02-26 22:51:52', '2017-02-26 22:51:52'),
(35, 'জাতীয় সম্পদ', '2017-02-26 22:52:28', '2017-02-26 22:52:28'),
(36, 'আইন-আদালত', '2017-02-26 22:52:39', '2017-02-26 22:52:39'),
(37, 'অনুকাব্য', '2017-02-26 22:52:48', '2017-02-26 22:52:48');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
