-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Feb 28, 2017 at 07:01 PM
-- Server version: 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `humansof_tg_blog`
--

-- --------------------------------------------------------

--
-- Table structure for table `tags`
--

CREATE TABLE IF NOT EXISTS `tags` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=39 ;

--
-- Dumping data for table `tags`
--

INSERT INTO `tags` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'কবিতা', '2017-02-20 08:14:07', '2017-02-20 08:14:07'),
(2, 'গল্প', '2017-02-20 08:14:39', '2017-02-20 08:14:39'),
(3, 'ছড়া', '2017-02-20 08:14:49', '2017-02-20 08:14:49'),
(4, 'প্রবন্ধ', '2017-02-20 08:15:12', '2017-02-20 08:15:12'),
(5, 'বিজ্ঞান ও প্রযুক্তি', '2017-02-20 08:15:31', '2017-02-20 08:15:31'),
(6, 'ভিডিও ব্লগ', '2017-02-20 08:15:46', '2017-02-20 08:15:46'),
(7, 'দর্শন', '2017-02-20 08:16:14', '2017-02-20 08:16:14'),
(8, 'রাজনীতি', '2017-02-20 08:16:59', '2017-02-20 08:16:59'),
(9, 'রান্না-রান্না', '2017-02-20 08:17:02', '2017-02-20 08:17:02'),
(10, 'শিল্প-সাহিত্য', '2017-02-20 08:17:09', '2017-02-20 08:17:09'),
(11, 'সংস্কৃতি', '2017-02-20 08:17:13', '2017-02-20 08:17:13'),
(12, 'মুক্তিযুদ্ধ', '2017-02-20 08:17:51', '2017-02-20 08:17:51'),
(13, 'সমসাময়িক', '2017-02-20 08:17:56', '2017-02-20 08:17:56'),
(14, 'আন্তর্জাতিক', '2017-02-20 08:18:03', '2017-02-20 08:18:03'),
(15, 'দুর্নীতি', '2017-02-20 08:18:18', '2017-02-20 08:18:18'),
(16, 'স্যাটায়ার', '2017-02-20 08:18:37', '2017-02-20 08:18:37'),
(17, 'উৎসব', '2017-02-20 08:19:14', '2017-02-20 08:19:14'),
(18, 'দিবস', '2017-02-20 08:19:21', '2017-02-20 08:19:21'),
(19, 'অনুবাদ', '2017-02-20 08:19:26', '2017-02-20 08:19:26'),
(20, 'একুশ', '2017-02-20 08:19:30', '2017-02-20 08:19:30'),
(21, 'খেলাধুলা', '2017-02-20 08:19:34', '2017-02-20 08:19:34'),
(22, 'চলচ্চিত্র', '2017-02-20 08:19:39', '2017-02-20 08:19:39'),
(23, 'ব্যক্তিগত কথাকাব্য', '2017-02-20 08:19:44', '2017-02-20 08:19:44'),
(24, 'ভ্রমণ কাহিনী', '2017-02-20 08:19:48', '2017-02-20 08:19:48'),
(25, 'শোকগাঁথা', '2017-02-20 08:19:53', '2017-02-20 08:19:53'),
(26, 'রিভিউ', '2017-02-26 22:44:42', '2017-02-26 22:44:42'),
(27, 'সাক্ষাৎকার', '2017-02-26 22:54:25', '2017-02-26 22:54:25'),
(28, 'ফটোব্লগ', '2017-02-26 22:49:56', '2017-02-26 22:49:56'),
(29, 'ঝালমুড়ি', '2017-02-26 22:50:16', '2017-02-26 22:50:16'),
(30, 'খবর', '2017-02-26 22:50:38', '2017-02-26 22:50:38'),
(31, 'কার্টুন', '2017-02-26 22:50:56', '2017-02-26 22:50:56'),
(32, 'উপন্যাস', '2017-02-26 22:51:23', '2017-02-26 22:51:23'),
(33, 'ইতিহাস', '2017-02-26 22:51:39', '2017-02-26 22:51:39'),
(34, 'অনুগল্প', '2017-02-26 22:51:54', '2017-02-26 22:51:54'),
(35, 'জাতীয় সম্পদ', '2017-02-26 22:52:30', '2017-02-26 22:52:30'),
(36, 'আইন-আদালত', '2017-02-26 22:52:36', '2017-02-26 22:52:36'),
(37, 'অনুকাব্য', '2017-02-26 22:52:46', '2017-02-26 22:52:46');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
