@extends('main')

@section('title', 'ব্লগ | বৃত্তান্ত')

@section('content')
      <div class="row">
        <div class="col-md-8">
          <h2 id="aboutBlog" style="padding-top: 70px; margin-top: -70px;"><i class="fa fa-book" aria-hidden="true"></i> ব্লগ সম্পর্কে<hr></h2>
          <p class="aboutPageParagraph">
            হিউম্যানস অব ঠাকুরগাঁও-এর যাত্রা শুরু হয় ২০১৬ সালে। ফেইসবুক পেইজের মাধ্যমে যাত্রা শুরু করা হিউম্যানস অব ঠাকুরগাঁও এর ব্লগের যাত্রা শুরু হল ফেব্রুয়ারি, ২০১৭ তে। ঠাকুরগাঁও-এর তরুণ এবং লিখতে আগ্রহীদের জন্য প্রথম একটি অনলাইন প্লাটফর্ম Blog | Humans of Thakurgaon.
          </p><hr><hr>

          <h2 id="faqs" style="padding-top: 70px; margin-top: -70px;"><i class="fa fa-question-circle" aria-hidden="true"></i> সাধারণ প্রশ্নোত্তর<hr></h2>
          <p class="aboutPageParagraph">
          	<strong>ব্লগ কি? ব্লগের দ্বারা আমি কি করতে পারি?</strong><br/><br/>
            ব্লগ শব্দটি ইংরেজি Blog এর বাংলা প্রতিশব্দ, যা এক ধরণের অনলাইন ব্যক্তিগত দিনলিপি বা ব্যক্তিকেন্দ্রিক পত্রিকা। ইংরেজি Blog শব্দটি আবার Weblog এর সংক্ষিপ্ত রূপ। যিনি ব্লগে পোস্ট করেন তাকে ব্লগার বলা হয়। ব্লগাররা প্রতিনিয়ত তাদের ওয়েবসাইটে কনটেন্ট যুক্ত করেন আর ব্যবহারকারীরা সেখানে তাদের মন্তব্য করতে পারেন। এছাড়াও সাম্প্রতিক কালে ব্লগ ফ্রিলান্স সাংবাদিকতার একটা মাধ্যম হয়ে উঠছে। সাম্প্রতিক ঘটনাসমূহ নিয়ে এক বা একাধিক ব্লগার রা এটি নিয়মিত আপডেট করেন।
            <br/><br/>
            বেশিরভাগ ব্লগই কোন একটা নির্দিষ্ট বিষয়সম্পর্কিত ধারাবিবরণী বা খবর জানায়; অন্যগুলো আরেকটু বেশিমাত্রায় ব্যক্তিগত পর্যায়ের অনলাইন দিনপত্রী/অনলাইন দিনলিপিসমূহ। একটা নিয়মমাফিক ব্লগ লেখা, ছবি, অন্য ব্লগ, ওয়েব পৃষ্ঠা আর এবিষয়ের অন্য মাধ্যমের লিংকের সমাহার/সমষ্টি। পাঠকদের মিথষ্ক্রিয়াময় ছাঁচে মন্তব্য করার সুবিধে-রাখা বেশিরভাগ ব্লগের একটা গুরুত্বপূর্ণ দিক। প্রায় ব্লগই মূলত লেখায় আকীর্ণ, কিছু কিছু আবার জোর দেয় শিল্প (আর্ট ব্লগ), ছবি (ফটোব্লগ), ভিডিও (ভিডিও ব্লগিং), সঙ্গীত (এমপিথ্রিব্লগ) আর অডিওর (পডকাস্টিং) ওপর। মাইক্রোব্লগিং-ও আরেকধরনের ব্লগিং, ওটায় খুব ছোট ছোট পোস্ট থাকে। ডিসেম্বর, ২০০৭-এর হিসেবে, ব্লগ খোঁজারু ইঞ্জিন টেকনোরাট্টি প্রায় এগারো কোটি বার লাখেরও বেশি ব্লগের হদিশ পেয়েছে। [Wikipedia]
            <br/><br/>

            <strong>Blog | Humans of Thakurgaon কি?</strong><br/><br/>
            হিউম্যানস অব ঠাকুরগাঁও-এর যাত্রা শুরু হয় ২০১৬ সালে। ফেইসবুক পেইজের মাধ্যমে যাত্রা শুরু করা হিউম্যানস অব ঠাকুরগাঁও এর ব্লগের যাত্রা শুরু হল ফেব্রুয়ারি, ২০১৭ তে। ঠাকুরগাঁও-এর তরুণ এবং লিখতে আগ্রহীদের জন্য প্রথম একটি অনলাইন প্লাটফর্ম Blog | Humans of Thakurgaon.
            <br/>
            এখানে যে কেউই একটি নিবন্ধনপূর্বক একটি একাউন্ট তৈরি করে একজন ব্লগার হতে পারেন। যেকোন বিষয় নিয়েই লেখা যেতে পারে। এক্ষেত্রে এতৎ ব্লগের <a href="{{ url('/categories/blogs') }}">বিষয় ও ট্যাগগুলো</a> দেখে নিলে সাহায্য হতে পারে।
            <br/><br/>

            <strong>কি,কি মনে রাখা উচিৎ যখন ব্লগ নিক (যে নামে লিখবেন) তৈরি করা হচ্ছে?</strong><br/><br/>
            ব্লগের <a href="/about#rules">নিয়মাবলী ও শর্তাবলী</a> অনুযায়ী ব্লগ নিক হওয়া উচিৎ যথার্থ এবং শ্লীল। কোন প্রকার অশ্লীল নিক গ্রহন করা হবে না। এছাড়া নিক শুধু অক্ষর এবং সংখ্যা হতে পারবে; স্পেইস, বিশেষ ক্যারেক্টার, কমা, সেমিকোলন ইত্যাদি গ্রহণযোগ্য হবে না।<br/><br/>

            <strong>আমি অন্যের লেখা কিভাবে পড়তে পারব?</strong><br/><br/>
            <a href="{{ url('/') }}">নীড় পাতা</a> থেকে অন্যের কোন লেখার টাইটেল ক্লিক করলে ওই লেখাটি পূ্র্ণভাবে দেখা যাবে। লিখেছেন এর পরে ব্লগারের নামে ক্লিক করলে ব্লগারের প্রোফাইলে চলে যাবে। সেখানে একই ব্লগারের সকল ব্লগপোস্ট পাওয়া যাবে।<br/><br/>

            
          </p><hr><hr>

          <h2 id="rules" style="padding-top: 70px; margin-top: -70px;"><i class="fa fa-plug" aria-hidden="true"></i> ব্লগ ব্যাবহারের নিয়মাবলী<hr></h2>

          <p class="aboutPageParagraph">
            <strong>কীভাবে নিবন্ধন করব?</strong><br/><br/>
            <img class="img-responsive" style="width: 80%" src="{{ asset('images/register.jpg') }}"><br/>
            ব্লগে নীড়পাতার উপরের মেনু (মোবাইলে ড্রপ ডাউন মেনু) থেকে 'নিবন্ধন' অপশনে ক্লিক করলে একটি নিবন্ধন ফর্ম আসবে। প্রয়োজনীয় তথ্য প্রদান করলে এবং তা গ্রহণযোগ্য হলে স্বয়ংক্রিয়ভাবে একাউন্ট তৈরি হবে এবং লগড-ইন হবে।
            <br/><br/>

            <strong>নিবন্ধন করেছি কিন্তু আমি বুঝতে পারছি না কিভাবে কি করব। সাহায্য করবেন?</strong><br/><br/>
            শুরুতে অন্যের লেখা পড়ুন ও (লগইন করার পর) অপরের ব্লগে মন্তব্য করে দেখুন । তাহলে বুঝতে পারবেন অনেক কিছু এবং লেখা সহজ হবে। নিজের লেখা প্রকাশ করতে হলে সর্ব উপরের মেনুতে (মোবাইলে ড্রপডাউন মেনু)  "নতুন ব্লগপোস্ট লিখুন" বাটোনে ক্লিক করে লেখা শুরু করে দিন!
            <br/><br/>

            <strong>ব্লগপোস্ট কীভাবে লিখব?</strong><br/><br/>
            নিজের লেখা প্রকাশ করতে হলে সর্ব উপরের মেনুতে (মোবাইলে ড্রপডাউন মেনু)  "নতুন ব্লগপোস্ট লিখুন" বাটোনে ক্লিক করলে আপনার ব্লগ লেখবার উইন্ডো-টি আসবে। সেখানে পোস্ট "শিরোনাম" এর ঘরে পোস্টের একটি নাম লিখুন। পার্মালিংকে আপনি আপনার পছন্দ মত কিছু লিখে দিলে তা আপনার ব্লগের ঠিকানার শেষ অংশ হিসেবে থাকবে। তবে এক্ষেত্রে শুধু অক্ষর, ড্যাশ, সংখ্যা ও আন্দারস্কোর গ্রহণযোগ্য। "বিষয়"-এর ঘরে পোস্টে যা নিয়ে তা নির্বাচন করুন। আপনার লেখার ধরন অনুসারে এক বা একাধিক ট্যাগ নির্বাচন করুন।<br/><br/>
            এরপর, প্রকাশ করুন রেডিও বাটনে চাপলে তা প্রকাশের জন্য প্রস্তুত হবে। ড্রাফট করুন সিলেক্ট করলে তা খসড়া হিসেবে ড্রাফট মেনুতে থেকে যাবে। সংরক্ষণ করুন বাটনে ক্লিক করলে তা রেডিও বাটনের সিলেকশন অনুযায়ী কাজটি করবে।<br/><br/>

            <strong>পোস্টে ছবি সংযুক্ত করব কীভাবে?</strong><br/><br/>
            <img class="img-responsive" style="width: 80%" src="{{ asset('images/editor.jpg') }}"><br/>
            আপনি আপনার ব্লগপোস্টে ছবি যুক্ত করতে হলে "insert/edit image" নামের বাটনে ক্লিক করুন একটি উইন্ডো আসবে যেখানে আপনি "Source" নামের একটি ঘর পাবেন, ওখানেই আপনার ইপ্সিত ছবির ডিরেক্ট লিংকটি (Direct link) কপি করে বসিয়ে দিন, "Ok" বাটনে ক্লিক করুন, ব্যাস আপনার ছবি যোগ হয়ে গেছে।<br/><br/>
            ছবির Direct link পাবার জন্য আপনি ঈপ্সিত ছবিটি আপনার ব্রাউজারে ওপেন করুন, এরপর ঐ ছবির উপর মাউসের ডান বাটনে ক্লিক করলে "কপি ইমেজ লোকেশন" অপশন পাবেন। আর আপনি যদি আপনার নিজস্ব কোন ছবি যুক্ত করতে চান সেক্ষেত্রে আপনাকে কোন ইমেজ হোস্টিং সাইটে সেই ছবি আপলোড করতে হবে। সেক্ষেত্রে আপনি www.tinypic.com অথবা অন্য কোনো ইমেজ হোস্টিং সাইটে আপনার ছবি আপলোড করলে সেখানে আপনি direct link নামে একটি লিংক পাবেন ঐটিই আপনাকে "ছবির ইউআরএল" ঘরে কপি পেস্ট করতে হবে।<br/><br/>
            আপনি ফেসবুক থেকে ছবি যোগ করতে চাইলে "ছবির ইউআরএল" ঘরে ইমেজ লিংক নয় বরং ইমেজ লোকেশন বসাতে হবে। ছবির লোকেশন কপি করতে আপনি ঐ ছবির উপর মাউসের ডান বাটনে ক্লিক করলে "কপি ইমেজ লোকেশন" অপশন পাবেন।<br/><br/>

            <strong>মন্তব্য এবং প্রতিমন্তব্য করব কীভাবে?</strong><br/><br/>
            আপনি ব্লগে ব্লগে লগড-ইন থাকা অবস্থায় আপনার নিজের লেখা বা অন্য ব্লগারের লেখা কোন পোস্টে মন্তব্য করতে পারবেন। এজন্য আপনাকে পোস্টের নিচে * মন্তব্য করুন * অপশনে আপনার সুচিন্তিত বক্তব্য লিখে 'সংরক্ষণ ও প্রকাশ করুন' বাটনে ক্লিক করলে আপনার মন্তব্যটি চলে আসবে। <br/><br/>
            লগড-ইন না থাকা অবস্থায় অতিথি হিসেবে মন্তব্য করবার কোন সুযোগ নেই<br/><br/> 

            <strong id="editCommentsAndReplies" style="padding-top: 70px; margin-top: -70px;">মন্তব্য এবং প্রতিমন্তব্য সম্পাদন করব কীভাবে?</strong><br/><br/>
            
            <img class="img-responsive" style="width: 80%" src="{{ asset('images/editCommRep.jpg') }}"><br/>
            ছবিতে দর্শানো বাটনে ক্লিক করলে একটি টেক্সটবক্সে নির্দিষ্ট মন্তব্য অথবা প্রতিমন্তব্যটি চলে আসবে। সম্পাদন করবার পর 'হালনাগাদ ও প্রকাশ করুন' বাটনে ক্লিক করলে মন্তব্য/ প্রতিমন্তব্যটি হালনাগাদ হয়ে যাবে।<br/><br/>  
          </p><hr><hr>

          <h2 id="conditions" style="padding-top: 70px; margin-top: -70px;"><i class="fa fa-gavel" aria-hidden="true"></i> ব্লগ ব্যবহারের শর্তাবলী<hr></h2>

          <p class="aboutPageParagraph">
            ১. 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও' ঠাকুরগাঁও-এর সাধারণ মানুষের লেখালেখির একটি অনলাইন প্ল্যাটফর্ম। এ প্ল্যাটফর্মে সাধারণ মানুষ বিশেষ করে তরুণেরা চিন্তা, মতামত, সৃজনশীলতা বিনিময় করতে পারবে। যুক্তি আর জ্ঞানের মিশ্রণে চমৎকার তথ্যবহুল প্রবন্ধ উপহার দিতে পারবে। তবে, এতৎ ব্লগটি স্পষ্টভাবেই বাংলাদেশ রাষ্ট্র, বাঙালী জাতিসত্তা, মুক্তিযুদ্ধ, স্বাধীনতা, বাঙালী সংস্কৃতি ও ঐতিহ্যের মত স্পর্শকাতর বিষয়গুলোকে আক্রমণ করে ব্লগপোস্ট, মন্তব্য, ছবি, অডিও, ভিডিও এবং পর্ণ প্রকাশ করার ক্ষেত্রে আপোষহীন থাকবে। কোন সতর্কবাণী ছাড়াই সংশ্লিষ্ট ব্লগপোস্ট ও ব্লগারের বিরুদ্ধে প্রয়োজনীয় ব্যবস্থা গ্রহণ করবে 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও' কর্তৃপক্ষ। 
            <br/><br/>
            ২. 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও' কোনভাবেই ধর্ম প্রচারের ক্ষেত্র নয়। যে কোন ধরণের সাম্প্রদায়িকতা, বর্ণবাদ, লিঙ্গ বৈষম্য, ধর্মীয় গোঁড়ামি এবং মহান মুক্তিযুদ্ধের পরাজিত শত্রু ও গোষ্ঠী সম্পর্কে 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও' জিরো টলারেন্স দেখাবে। ধর্ম সংক্রান্ত উস্কানিমূলক ব্লগপোস্ট এবং ব্লগারের নিবন্ধন বাতিল করা হবে সতর্কবাণী ব্যতিরেকে।
            <br/><br/>
            ৩. পূর্বে অন্য কমিউনিটি ব্লগে প্রকাশিত লেখা 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও'-এ প্রকাশ করার ক্ষেত্রে কর্তৃপক্ষ নিরুৎসাহিত করছে (ব্যক্তিগত-ব্লগ বা ফেসবুকের ক্ষেত্রে প্রযোজ্য নয়)। 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও'-এ প্রকাশিত নতুন লেখা অন্য কমিউনিটি ব্লগে প্রকাশর ক্ষেত্রে এতৎ ব্লগটির নাম উল্লেখ থাকা বাঞ্ছনীয়। অন্য কমিউনিটি ব্লগে পূর্বে বা একই সময়ে প্রকাশিত কোন লেখা 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও'-এ 'নির্দেশিত প্রবন্ধ'-এর জন্য মনোনীত হবেনা এবং ব্লগ | হিউম্যানস অব ঠাকুরগাঁওের কোনোরূপ প্রকাশনায় (ই-বুক কিম্বা সম্মিলিত বই) স্থান পাবে না বা কোন বিশেষ বিবেচনার ক্ষেত্রে মনোনয়ন পাবে না। তবে, কোন মুদ্রণ মাধ্যম এই নীতির আওতায় পড়বে না।
            <br/><br/>
            ৪. কপিরাইট লঙ্ঘন করে, এমন কোনও উপাদান ব্লগ | হিউম্যানস অব ঠাকুরগাঁও-এ প্রকাশ করা যাবে না। পোস্ট বা মন্তব্যে অন্যত্র প্রকাশিত উপাদান ব্যবহার করলে তার সূত্র উল্লেখ করতে হবে।
            <br/><br/>
            ৫. যে কোনো ধরনের স্প্যামিং, ম্যালিশাস কোড অথবা এ ধরণের আপত্তিকর কোন কোড পেলে তা মুছে দেয়া হবে।
            <br/><br/>
            ৬. 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও'-এ ব্লগার হিসাবে একে অপরের প্রতি দলবদ্ধ আক্রমণ, অশিষ্টাচার মন্তব্য, এজেন্ডাভিত্তিক ব্লগিং প্রভৃতি থেকে বিরত থাকতে হবে। কোন ব্লগার আক্রান্তবোধ করলে তাঁর করা অভিযোগের ভিত্তিতে ব্লগ | হিউম্যানস অব ঠাকুরগাঁও এডমিন বা ব্লগ | হিউম্যানস অব ঠাকুরগাঁও এর যেকোন মডারেটর সেই আক্রমণাত্মক পোস্ট, মন্তব্য বা উপাদান সরিয়ে দিতে পারেন। ব্লগারের ব্লগপোস্টের মন্তব্য যদি তিনি 'রিপোর্ট' করে থাকেন, তবে সংশ্লিষ্ট কর্তৃপক্ষের বিবেচনাপ্রসূত সিদ্ধান্তই কার্যকর হবে। 
            <br/><br/>
            ৭. 'চিরকুট' পাঠাবার ক্ষেত্রে অবশ্যই শালীন ভাষায় বক্তব্য উপস্থাপন করতে হবে। ব্লগার কোন চিরকুটের বিরুদ্ধে রিপোর্ট করলে চিরকুটটি বিবেচনা করে প্রদানকারীর বিরুদ্ধে ব্যবস্থা নেওয়া হতে পারে।
            <br/><br/>
            ৮. ব্লাড ব্যাংক-এ গিয়ে অহেতুক কোন ডোনারকে 'রক্তদান অনুরোধ' করা যাবে না। এ ব্যাপারে সংশ্লিষ্ট ভুক্তভোগী ব্লগারকে জরুরী ভিত্তিতে ব্লগের মেনুর 'যোগাযোগ' অপশনে গিয়ে ব্লগ | হিউম্যানস অব ঠাকুরগাঁও কর্তৃপক্ষ-কে জানানোর জন্য অনুরোধ করা হচ্ছে। গুরুত্ব বিবেচনা করে সেক্ষেত্রে ব্লাড ব্যাংক পাতাটির লে-আউটে পরিবর্তন করে দ্বিতীয় কোন উপায়ের ব্যবস্থা করবার এখতিয়ার ব্লগ | হিউম্যানস অব ঠাকুরগাঁও কর্তৃপক্ষ সম্পূর্ণভাবে সংরক্ষণ করে।  
            <br/><br/>
            ৯. অন্য কোন ব্লগ, সাইট, ব্যক্তিগত বা ব্যবসায়ীক সাইটের প্রচারণার ক্ষেত্র হিসেবে ব্লগ | হিউম্যানস অব ঠাকুরগাঁও-এ কোনও ব্লগপোস্ট দেওয়া যাবে না। এই ধরণের প্রচারণামূলক ব্লগপোস্ট মুছে ফেলার অধিকার ব্লগ | হিউম্যানস অব ঠাকুরগাঁও কর্তৃপক্ষ সংরক্ষণ করেন।
            <br/><br/>
            ১০. বক্তব্যহীন, ফেসবুকের স্ট্যাটাস আকারের অগুরুত্বপূর্ণ বা ব্লগ | হিউম্যানস অব ঠাকুরগাঁও'র মডারেশন প্যানেলের কাছে কোন পোস্ট গুরুত্বহীন মনে হলে 'স্প্যামিং' এর আওতায় গণ্য করে পোস্টটি প্রথম পাতা থেকে সরিয়ে দেওয়া বা মুছে দেওয়ার ক্ষমতা ব্লগ | হিউম্যানস অব ঠাকুরগাঁও কর্তৃপক্ষ সংরক্ষণ করেন।
            <br/><br/>
            ১১. ব্লগ | হিউম্যানস অব ঠাকুরগাঁও-এ প্রকাশিত সকল লেখা এবং মন্তব্যের দায় লেখক-ব্লগার ও মন্তব্যকারীর। কোন পোস্ট এবং মন্তব্যের দায় কোন অবস্থায় 'ব্লগ | হিউম্যানস অব ঠাকুরগাঁও' কর্তৃপক্ষ বহন করবে না। ব্লগ | হিউম্যানস অব ঠাকুরগাঁও-এ প্রকাশিত লেখা লেখকের অনুমতি বা সূত্র উল্লেখ ব্যতীত অন্য কোনও মাধ্যমে প্রকাশ করা যাবেনা।
            <br/><br/>
            ১২. ব্লগ | হিউম্যানস অব ঠাকুরগাঁও-এ ব্লগার হতে হলে অবশ্যই বাংলায় নিক ব্যবহার করে নিবন্ধন করতে হবে। ইংরেজি নিকের আবেদন গ্রহণ করা হবেনা। বাংলার পাশাপাশি ইংরেজি ব্যতীত অন্য কোন বর্ণমালায় ব্লগ | হিউম্যানস অব ঠাকুরগাঁও-এ পোস্ট বা মন্তব্য গ্রহণযোগ্য নয়।
            <br/><br/> 
            পুনশ্চঃ ব্লগ | হিউম্যানস অব ঠাকুরগাঁও কর্তৃপক্ষ রক্তদান কর্মসূচিকে বিপুল উৎসাহিত করে। এই কম্যুনিটির অংশ হবার পূর্বশর্ত হল, রক্তদানের উপযুক্ততা থাকলে অবশ্যই ব্লগারকে রক্তদানে আগ্রহী হতে হবে!
            <br/><br/> 
          </p>
          
        </div>
        <div class="col-md-4">
        	<img src="{{ asset('images/aboutimage.jpg') }}" class="img-responsive panel">
        </div>
      </div>
@endsection